console.log('///////////////////////////////////// 1 //////////////////////////////////////////');
// Работа с concat
// Для решения задач данного блока вам понадобятся следующие методы: concat.
// Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.

const arr1 = [1, 2, 3];
const arr2 = [4, 5, 6];

const concat = arr1.concat(arr2);

console.log(concat);

console.log('///////////////////////////////////// 2 //////////////////////////////////////////');

// Работа с reverse
// Для решения задач данного блока вам понадобятся следующие методы: reverse.
// Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].

const reverse = arr1.reverse();

console.log(reverse);

console.log('///////////////////////////////////// 3 //////////////////////////////////////////');

// Работа с push, unshift
// Для решения задач данного блока вам понадобятся следующие методы: push, unshift.
// Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
// Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.

const push = arr1.push(4, 5, 6)

console.log(arr1);
console.log(push); //??????????????????

const unshift = arr1.unshift(4, 5, 6)

console.log(arr1);

console.log('///////////////////////////////////// 4 //////////////////////////////////////////');

// Работа с shift, pop
// Для решения задач данного блока вам понадобятся следующие методы: shift, pop.
// Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.
// Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.

const arr3 = ['js', 'css', 'jq'];
const arr4 = ['js', 'css', 'jq'];

const shift = arr3.shift(2)

console.log(shift);

const pop = arr4.pop(2)

console.log(pop);

console.log('///////////////////////////////////// 5 //////////////////////////////////////////');

// Работа с slice
// Для решения задач данного блока вам понадобятся следующие методы: slice.
// Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].
// Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5].

const arr5 = [1, 2, 3, 4, 5];

const slice = arr5.slice(0, 3)

console.log(slice);

const slice2 = arr5.slice(3, 5)

console.log(slice2);

console.log('///////////////////////////////////// 6 //////////////////////////////////////////');

// Работа с splice
// Для решения задач данного блока вам понадобятся следующие методы: splice.
// Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].
// Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].
// Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

const splice3 = arr5.splice(1, 2)
console.log(arr5);

const arr6 = [1, 2, 3, 4, 5];

const splice4 = arr6.splice(1, 3)
console.log(splice4);

const arr7 = [1, 2, 3, 4, 5];

const splice5 = arr7.splice(3, 0, 'a', 'b', 'c',)
console.log(arr7);

const arr8 = [1, 2, 3, 4, 5];

arr8.splice(1, 0, 'a', 'b')
arr8.splice(6, 0, 'c')
arr8.splice(8, 0, 'e')
console.log(arr8);

console.log('///////////////////////////////////// 7 //////////////////////////////////////////');

// Работа с sort
// Дан массив [3, 4, 1, 2, 7]. Отсортируйте его по возрастанию. ( Отсортируй с помощью sort)

const arr9 = [3, 4, 1, 2, 7];

const sort = arr9.sort()

console.log(sort);

console.log('///////////////////////////////////// 7 //////////////////////////////////////////');

// Работа с Object.keys
// Дан объект {js:'test', jq: 'hello', css: 'world'}. Получите массив его ключей.


const obj = {
    js: 'test',
    jq: 'hello',
    css: 'world'
};

const arrObj = [];

for (var key in obj) {
    arrObj.push(key)
}
console.log(arrObj);

console.log('///////////////////////////////////// BLOCK 2 //////////////////////////////////////////');
console.log('///////////////////////////////////// 1 //////////////////////////////////////////');

// Блок 2
// Заполните массив следующим образом: в первый элемент запишите 'x', во второй 'xx', в
// третий 'xxx' и так далее.

const arr10 = [];
let x = '';

for (let i = 0; i < 10; i++) {
    x += 'x'
    arr10[i] = x;
}

console.log(arr10);

console.log('///////////////////////////////////// 2 //////////////////////////////////////////');

// Заполните массив следующим образом: в первый элемент
// запишите '1', во второй '22', в третий '333' и так далее.

const arr11 = [];
let str = ''
for (let i = 1; i < 10; i++) {
    for (let j = 1; j <= i; j++)
        str += i;
        arr11.push(str); //?????????????
        str = ''
}

console.log(arr11);

console.log('///////////////////////////////////// 3 //////////////////////////////////////////');

// Сделайте функцию arrayFill, которая будет заполнять массив заданными значениями.
// Первым параметром функция принимает значение, которым заполнять массив, а вторым -
// сколько элементов должно быть в массиве. Пример: arrayFill('x', 5) сделает массив
// ['x', 'x', 'x', 'x', 'x'].

function arrayFill(str, x) {
    const arr = [];
    for (let i = 0; i < x; i++) {
        arr[i] = str
    }
    return arr
}

console.log(arrayFill('x', 5))

console.log('///////////////////////////////////// 4 //////////////////////////////////////////');

// Дан массив с числами. Узнайте сколько элементов с начала массива надо сложить,
// чтобы в сумме получилось больше 10-ти.

const arr12 = [1, 2, 3, 4, 5, 6]
let sum = 0;

for (let i = 0; i < arr12.length; i++) {
    if( sum <= 10) {
        sum += arr12[i]
    } else {
        console.log(i);
    }
    
}